Revit 2023 API
DetailElementOrderUtils.BringForward Method (Document, View, ICollection<ElementId>)
 Moves the given detail instances one step closer to the front of all other detail instances in the view, while keeping the order of the given ones.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public static void BringForward(
	Document pDocument,
	View pDBView,
	ICollection<ElementId> detailElementIds
)
Visual Basic
Public Shared Sub BringForward ( _
	pDocument As Document, _
	pDBView As View, _
	detailElementIds As ICollection(Of ElementId) _
)
Visual C++
public:
static void BringForward(
	Document^ pDocument,
	View^ pDBView,
	ICollection<ElementId^>^ detailElementIds
)
Parameters
pDocument
Type: Autodesk.Revit.DB.Document
 The document.
pDBView
Type: Autodesk.Revit.DB.View
 The view.
detailElementIds
Type: System.Collections.Generic.ICollection<ElementId>
 The set of detail elementIds to bring forward.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The set detailElementIds contains one or more non-detail element Ids.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DetailElementOrderUtils Class
BringForward Overload
Autodesk.Revit.DB Namespace